#-*- coding:utf-8 -*-
#指定中文编码

###########################################################################################################################
#
#   通风机标签数据类模块
# 
###########################################################################################################################

from    dataclasses     import  (
        dataclass,                      # dataclass装饰器
        field,                          # field函数
        fields,                           # fields函数
        asdict                          # asdict函数
)

from    typing          import  List

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
#
#   数据标签
#
@dataclass(
    init = True,    # 是否生成 __init__
    repr = True     # 是否生成 __repr__
)
class DataRoadwayJ:

    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   数据结构
    #

    r: float = field(
        default = None,
        metadata = {
            'rights'    :   'lj',
            'ch'        :   '风阻系数'
        }
    )

    ex: float = field(
        default = 2.0,
        metadata = {
            'rights'    :   'lj',
            'ch'        :   '风量指数'
        }
    )

    fans: List = field(
        default_factory =   list,
        metadata        =   {
            'rights'    :   'lj',
            'ch'        :   '绑定风机列表'
        }        
    )

    structures: List = field(
        default_factory =   list,
        metadata        =   {
            'rights'    :   'lj',
            'ch'        :   '绑定构筑物列表'
        }        
    )

    sensors: List = field(
        default_factory =   list,
        metadata        =   {
            'rights'    :   'lj',
            'ch'        :   '绑定传感器列表'
        }        
    )

    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
