#-*- coding:utf-8 -*-
#指定中文编码

######################################################################################
#
#   通风网络动力模块    fanH
#
######################################################################################

#   注意:
#   （1）静压传感器
#   （2）传感器位置: 风机入风口、出风口
#   （3）正常情况下标定风机入口静压为负, 出口为正
#   （4）注意入口静压为正, 风机为阻力
#   （5）注意出口静压为负, 风机为阻力
#   （6）sword
#   （7）理论上说静压观测点与位置无关, 进口出口都一样
#   （8）风机反转，动力方向发生变化，进出口也同时发生变化

from    .vp     import  VentPower
import  math
#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
#
#	风路类
#
class FanH(VentPower) :
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   构造函数
    def __init__(self, id, h) :
        VentPower.__init__(self, id)
        self.h     =   h      # 工况静压
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   动力计算函数
    #   传感器上传为正值，需要调成负值sword
    def GetH(self, q):
        # print(self.id, q, self.h)
        return self.h
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   动力计算函数斜率        sword ???
    #   slope 不计修正值偏大，收敛快，能否震荡？？？
    def GetSlope(self, q):
        # alpha = math.radians(self.alpha)
        # alpha = math.radians(75)
        # # h = -math.tan(alpha)*q + self.h + q*math.tan(alpha)
        # slope = -math.tan(alpha)
        # return slope
        return 0
        # return pow(abs(self.h), 0.5)
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
  
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   动力计算函数斜率        sword ???
    #   slope 不计修正值偏大，收敛快，能否震荡？？？
    def GetResis(self, q):
        # alpha = math.radians(self.alpha)
        # h = -math.tan(alpha)*q + self.h0 + self.q0*math.tan(alpha)
        # slope = -math.tan(alpha)
        return 0
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
