#-*- coding:utf-8 -*-
#指定中文编码


######################################################################################
#
#   通风网络解算器模块
#
######################################################################################

#   1 通风网络之风路特点: 有方向
#
#   2 说明
#   （1）风流风向定义为风路方向, 风流由始节点流向末节点
#   （2）摩擦阻力, 压差也具有方向性
#   （3）压差导数取绝对值
#   （4）网络解算出现负风量表明风路始末节点方向与风流方向不一致
#   （5）主要风路负风量要调整始末节点编号, 角联风路不必调整

#   3 迭代中风量方向变化问题
#   3.1 构筑物
#   （1）等效风阻型
#       等效风阻属于井巷风阻的一部分而且永远为正值, 所以压差和阻力均随风量变化
#   （2）压差型
#       无论压差是正还是负, 都是井巷的一部分，总阻力，总压差增大, 随风流方向
#   3.2 通风动力
#  

import numpy    as  np

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
#
#	风路类
#
class Road :

    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   构造函数
    def __init__(self, 
        id                  =   None, 
        s                   =   None, 
        t                   =   None, 
        r                   =   None, 
        ex                  =   2.0, 
        # sourceSinkQ         =   0,
        # fixedQ              =   None,
        # initQ               =   None,
        # weight              =   None,
        # fixed               =   None,
        **kwargs
    ) :
        self.id             =   id              # 风路id, str, 不可缺省
        self.s              =   s               # 始节点id, str, 不可缺省
        self.t              =   t               # 末节点id, str, 不可缺省

        self.r              =   r               # 通风阻力系数, float, Ns^2m^-8,反演可缺省
        # self.sourceSinkQ    =   sourceSinkQ     # 源汇风量, float, m^3s^-1
                                                # 漏入风路为正，漏出为负
        self.ex             =   ex              # 风量指数, float, 默认2.0

    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   摩擦阻力计算函数
    def GetResis(self, q) :
        return np.sign(q) * self.r * abs(q)**self.ex
        # 注意: abs(q) , q<0,ex=1.87, 迭代出现q=nan       
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   始末端点压差计算函数
    def GetH(self, q) :
        # return self.GetResis(q)       # 错误，迭代出问题
        return np.sign(q) * self.r * abs(q)**self.ex
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   始末端点压差斜率（注意无-，动力有）
    def GetSlope(self, q) :
        # return abs(self.ex * self.r * q)
        return self.ex * self.r * q
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

