#-*- coding:utf-8 -*-
#指定中文编码

######################################################################################
#
#   构筑物函数模块  structH
#
######################################################################################
#
#   说明:
#   （1）一般来说，构筑物都存在一定的阻力，两侧有压差，风量会较小
#   （2）构筑物压差及风量都存在不可测问题
#   V2.0 构筑物参与网络解算方式及优先次序:
#   （1）构筑物压差参与网络解算迭代，首选
#   （2）构筑物低风量作为固定分支不参与迭代，次选，
#   （3）r*q**ex参与迭代计算，备选
#   

#   测试表明，如果构筑物压差过大，为了平衡网络，构筑物分支会反向，structH为正-小q**2*roadR
#   !!!!!!!!!?????????????

import  numpy       as      np
from    .struct import  Struct

#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
#
#	广义构筑物类
#
class StructH(Struct) :
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   构造函数
    def __init__(self, id, eid=None, h=None, **kwards) :
        Struct.__init__(self, id, eid,**kwards)
        self.h = h
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
 
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   压差
    def GetH(self, q) :
        # return abs(h)
        # 测试表明上式有问题，如果没有风速传感器，仅有压差传感器，当压差传感器变负时，不能改变风流方向
        return self.h
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
 
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
    #   压差斜率
    #
    #   test-20221205测试数据表明, 如果令slope=0, 会出现震荡不收敛
    def GetSlope(self, q) :
        #return np.sign(q) * abs(h / q)    # q 是迭代风量，而非压差对应风量， 所以弃用
        # 待测试，巷道也是迭代风量，但巷道是实时压差，所以倾向按0计算
        # slope = np.sign(q) * (self.ex * (self.h/abs(q)**self.ex) * q)
        # 注意一定要 abs(q), 例如print(-10**1.37)为负值
        # return pow(abs(self.h), 0.5)      # 偏差较大, r1收敛，r0不收敛
        # return slope
        return 0
        # if q > 0 :
        #     return self.ex * (self.h / q**self.ex)
        # else :
        #     return -1 * (self.ex * (self.h/abs(q)**self.ex) * q)
    #€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
