#-*- coding:utf-8 -*-
#指定中文编码

###########################################################################################################################
#
#	图类
#
###########################################################################################################################

#   源汇点、源汇边注意掘进巷与风筒共用汇点情况

from    jl.network.i_graph.g.create_igraph  import  create_igraph

#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
#
#   拓扑关系
#
def get_topology(edges) -> dict :

    g = create_igraph(edges=edges)

    return {     # 常用拓扑关系
        'esum'          :   len(g.es),                     # int, 分支总数
        'vsum'          :   len(g.vs),                        # int, 节点总数
        'eids'          :   [g.es['id']],       # list, [eid, ...], 分支id列表
        'vids'          :   [g.vs['id']],                             # list, [vid, ...], 节点id列表
        'sourceNodes'   :   [g.vs[v.index]['id'] for v in g.vs if g.degree(v, mode='in')==0 and g.degree(v, mode='all')==1], 
                            # list, [vid, ...], 源点id列表
        'sinkNodes'     :   [g.vs[v.index]['id'] for v in g.vs if g.degree(v, mode='out')==0 and g.degree(v, mode='all')==1],
                            # list, [vid, ...], 汇点id列表
        'sourceEdges'   :   [g.es[ei]['id'] for vi in g.vs if g.degree(vi, mode='in')==0 and g.degree(vi, mode='all')==1 for ei in g.incident(vi,mode='out')],
        'sinkEdges'     :   [g.es[ei]['id'] for vi in g.vs if g.degree(vi, mode='out')==0 and g.degree(vi, mode='all')==1 for ei in g.incident(vi,mode='in')],
        'mape'          :   {**{e['id']:e for e in edges}}                           # dict
    }
#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
#
#   判断是否连通图
#
def is_connected(edges) :
    g = create_igraph(edges=edges)
    return g.is_connected(mode='weak')     # 判断是否为连通图
#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
#
#   提取联通图
#
def get_connected_graph(edges) :
    g = create_igraph(edges=edges)
    subgs = [list(subg.es['id']) for subg in g.components(mode='weak').subgraphs()] # list, [[eid1, ...], ...], 提取联通子图
    return subgs
#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
#
#   判断是否为有向无环图（无单向回路、无单节点环）
#
def is_dag(edges) :
    g = create_igraph(edges)
    return g.is_dag()
#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
#
#   提取单节点环
#
def get_loops(edges) :
    return [(e['id'],e['s']) for e in edges if e['s']==e['t']]
#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
#
#   节点入边
#
def get_node_in_edge(edges) :
    g = create_igraph(edges)
    return {**{v['id'] : g.es[g.incident(v,mode='in')]['id'] for v in g.vs}}
#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€

#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
#
#   节点出边
#
def get_node_out_edge(edges) :
    g = create_igraph(edges)
    return {**{v['id'] : g.es[g.incident(v,mode='out')]['id'] for v in g.vs}}
#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
