#-*- coding:utf-8 -*-
#指定中文编码

###########################################################################################################################
#
#	有向图类（无向图通路、最短路单独设置    注意索引的随机性）
#
###########################################################################################################################

from    .create_igraph  import  create_igraph

#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€
#
#   单向回路
#
def get_unidirectional_loops(edges) :

    g = create_igraph(edges=edges)

    cl = g.components(mode='strong')
    comps = []
    for g in cl.subgraphs():
        # 至少2条边才能构成单向回路
        if len(g.es) < 2:continue
        # 子图的index与原图已经不一致了!
        # 这里只能使用id属性进行返回!
        comps.append([e["id"] for e in g.es])
    # 释放内存
    del cl
    return comps
#€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€€


